Revit 2024 API
IFCFile Methods
The IFCFile type exposes the following members.
Methods
Name | Description
Close
 Close the IFC file.
Create
 Creates an IFC file for exporting.
CreateHeaderInstance
 Creates an IFC header instance in the file model.
CreateInstance
 Creates an IFC instance in the file model.
CreateStyle(ExporterIFC, IFCAnyHandle)
 Creates and populates an IfcStyledItem for an IfcRepresentationItem with a IfcSurfaceStyle, IfcCurveStyle, and/or an IfcFillStyle, and assigns them to the file.
CreateStyle(ExporterIFC, IFCAnyHandle, Color, ElementId)
 Creates and populates an IfcStyledItem for an IfcRepresentationItem with a IfcSurfaceStyle, IfcCurveStyle, and/or an IfcFillStyle, and assigns them to the file.
Dispose
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetInstanceCount
 Counts IFC instances of one particular type.
GetInstances
 Gets IFC instances of one particular type.
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
Read(IFCFileReadOptions)
 Reads content from a file of IFC format.
Read(IFCFileReadOptions, Int32, Int32)
 Reads content from a file of IFC format.
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Write
 Writes content to a file of IFC format.
See Also
IFCFile Class
Autodesk.Revit.DB.IFC Namespace